Enterprise_Serivces/Cert/Bronze4/CSLRealmUserService/result1/Iteration1/t3_RequestBody.txt

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/03/addressing"><soap:Header><wsa:Action>http://www.gamestop.com/services/csl/realmuser/contracts/2010/05/IRealmUserService/UpdateRealmUserByCustomerID</wsa:Action><wsa:MessageID>uuid:7b65571d-04d8-42d0-8ddf-71c8378607a6</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/03/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:To>http://cslrealmuserserviceqa1.testgs.pvt/RealmUserService.svc</wsa:To></soap:Header><soap:Body><UpdateRealmUserByCustomerID xmlns="http://www.gamestop.com/services/csl/realmuser/contracts/2010/05"><request><MachineName xmlns="http://www.gamestop.com/services/core/contracts/2010/05">test</MachineName><CustomerID xmlns="http://www.gamestop.com/services/csl/RealmUser/contracts/messages/2011/05">2150431</CustomerID><OpenID xmlns="http://www.gamestop.com/services/csl/RealmUser/contracts/messages/2011/05">https://loginqa.gamestop.com/ID/dz79PLgXNkWwlG6rsevhuw</OpenID></request></UpdateRealmUserByCustomerID></soap:Body></soap:Envelope>